In [1]:
import pandas as pd
import numpy as np

In [4]:
#Dictionary객체로 DataFrame 생성
data={"2020":[9668465,3391946,2942828,1450062],"2010":[10312545,3567910,2758296,1454636]}
df=pd.DataFrame(data,index=["서울","부산","인천","광주"])

#또는 df.index=["서울","부산","인천","광주"] 로 인덱스 선언 가능
df

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

In [5]:
#DataFrame 인덱스 지정하여 생성(2중 list  구조 활용)

data2=[[9668465,3391946,2942828,1450062],
       [10312545,3567910,2758296,1454636]]
ind=['2020','2010']
col=['서울','부산','인천','광주']
df2=pd.DataFrame(data2,index=ind,columns=col)
df2

            서울       부산       인천       광주
2020   9668465  3391946  2942828  1450062
2010  10312545  3567910  2758296  1454636

In [6]:
# DataFrame의 행과 열을 전치
df2=df2.T
df2

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

In [7]:
# DataFrame 값을 2차원 array형태로 확인
df2.values

array([[ 9668465, 10312545],
       [ 3391946,  3567910],
       [ 2942828,  2758296],
       [ 1450062,  1454636]], dtype=int64)

In [8]:
# DataFrame 인덱스 확인
df2.index

Index(['서울', '부산', '인천', '광주'], dtype='object')

In [9]:
# DataFrame 컬럼 확인
df2.columns

Index(['2020', '2010'], dtype='object')

In [11]:
# df2 데이터프레임 중, '2020'컬럼에 해당하는 모든 값들을 시리즈 형태로 출력
# 대괄호를 한번만 씌움
df2["2020"]

서울    9668465
부산    3391946
인천    2942828
광주    1450062
Name: 2020, dtype: int64

In [12]:
# df2 데이터프레임 중, '2020'컬럼에 해당하는 모든 값들을 데이터프레임 형태로 출력
# 대괄호를 두번 씌움
df2[["2020"]]

       2020
서울  9668465
부산  3391946
인천  2942828
광주  1450062

In [14]:
# '2020'과 '2021' 컬럼에 해당하는 모든 값들을 데이터프레임 형태로 출력
df2[["2020","2010"]]

       2020      2010
서울  9668465  10312545
부산  3391946   3567910
인천  2942828   2758296
광주  1450062   1454636

In [15]:
# 'df2'이라는 데이터프레임에 컬럼 추가 및 해당되는 컬럼값 추가.
# 아래의 코드는, df2에 '2005'라는 컬럼명을 가진 컬럼을 추가하고, 이에 해당되는 값들을 추가.(list)
df2["2005"]=[9762546,3512547,2517680,1456016]
df2

       2020      2010     2005
서울  9668465  10312545  9762546
부산  3391946   3567910  3512547
인천  2942828   2758296  2517680
광주  1450062   1454636  1456016

In [17]:
# df2에서 0번째 이상 2번째 미만인 행들을 출력 
df2[0:2]

       2020      2010     2005
서울  9668465  10312545  9762546
부산  3391946   3567910  3512547

In [19]:
df.loc["부산":"인천" , "2020":"2010" ]  
# .loc 사용 (location)
# 부산과 인천에 해당되는 인덱스와, 2020과 2010에 해당하는 컬럼을 가져옴

       2020     2010
부산  3391946  3567910
인천  2942828  2758296

In [24]:
df2.loc[df2['2010']>=2500000,]
# '2010' 컬럼 값들 중, 250만 이상인 행들만 출력

       2020      2010     2005
서울  9668465  10312545  9762546
부산  3391946   3567910  3512547
인천  2942828   2758296  2517680

In [27]:
# csv파일을 바탕으로 데이터프레임 생성
population = pd.read_csv('population.csv', encoding='utf-8')
population

   도시   지역     2015       2010       2005     2000
0  서울  수도권  9904312  9631482.0  9762546.0  9853972
1  부산  경상권  3448737        NaN        NaN  3655437
2  인천  수도권  2890451  2632035.0        NaN  2466338
3  대구  경상권  2466052  2431774.0  2456016.0  2473990

In [29]:
# 데이터프레임에 population.csv에 있는 컬럼들 중, '도시'컬럼을 인덱스로 지정함
population = pd.read_csv('population.csv',index_col="도시",encoding='utf-8')
population

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

- sort_index 함수 : 인덱스 값을 기준으로 정렬하는 방법

In [31]:
population.sort_index()
# 인덱스 값들을 가나다 순으로 정렬 >> 대구, 부산, 서울, 인천

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338

sort_value: 데이터 값을 기준으로 오름차순 정렬

In [32]:
population['2010'].sort_values()

도시
대구    2431774.0
인천    2632035.0
서울    9631482.0
부산          NaN
Name: 2010, dtype: float64

sort_value(ascending=False): 데이터 값을 기준으로 내림차순 정렬ㅡ

In [33]:
population['2010'].sort_values(ascending=False)

도시
서울    9631482.0
인천    2632035.0
대구    2431774.0
부산          NaN
Name: 2010, dtype: float64